#include "eval.h"

#define ARCHIVE_NUM_MAX		100
#define MAX_EVENTS		100

#define ANALYSE			1
#define NO_ANALYSE		0

#define TYPE_CURRENTS		0
#define TYPE_HOURS		1
#define TYPE_DAYS		2
#define TYPE_MONTH		4
#define TYPE_INCREMENTS		7
#define TYPE_EVENTS		9
#define TYPE_CONST		10
//-----------------------------------------------------------------------------
struct _AnsLog {
  uint8_t checksym;	// checksum status (true - ok, false - bad)
  uint8_t  from;	// source address (SPG)
  uint8_t  to;		// reciever address (controller)
  uint8_t  func;	// answer function
  char 	head[100];	// answer header
  uint8_t  pipe;	// channels or pipe number
  uint8_t  nadr;	// parametr or array number
  uint8_t crc;		// checksum

  uint8_t  from_param;	// [index] from which parametr read
  uint8_t  quant_param;	// [index] parametrs quant

  char  data [ARCH_MAX_NPARAM][ARCHIVE_NUM_MAX][120];	// [для всех запросов на чтение] значения параметров
  char  time [ARCH_MAX_NPARAM][ARCHIVE_NUM_MAX][30];	// [для всех запросов на чтение] метка времени
};
typedef struct _AnsLog AnsLog;
//-----------------------------------------------------------------------------
#define	GET741_HOURS	0x48
#define	GET741_DAYS	0x59
#define	GET741_MONTHS	0x4D
#define	GET741_RAM	0x52
#define	GET741_FLASH	0x45
#define	GET741_PARAM	0x72
#define	SET741_PARAM	0x44
#define	START_EXCHANGE	0x3F

#define DLE 	0x10  	// символ-префикс.
#define HT  	0x09  	// код горизонтальной табуляции
#define ZERO  	0x0 	// просто ноль
#define UK  	0x16  	// управляющий код конца кадра
//-----------------------------------------------------------------------------
typedef struct _Archive arch;

struct _Archive {
    uint8_t	id;		// номер порядковый
    uint16_t	no;		// номер параметра 
    uint16_t	adr;		// адрес в пространстве Логики 
    char	name[200];	// текстовое название параметра
    float	knt;		// коэффициент пересчета величины
    uint16_t	type;		// тип элемента (0-часовой, 1-суточный, 2-декадный, 3-по месяцам, 4-сменный)
    char	meas[15];	// текстовое название еденицы измерения
};
//-----------------------------------------------------------------------------
struct _Archive currents741 [] =
    {	{ARCH_PAVG,18,0x228,"Измеренное значение давления газа (P1)",1,0x1,"МПа"},
//	{ARCH_PAVG,38,0x244,"Измеренное значение давления газа (P2)",1,0x1,"МПа"},
	{ARCH_DPAVG,19,0x22c,"Измеренное значение перепада давления газа (dP1)",1,0x1,"МПа"},
//	{ARCH_DPAVG,39,0x248,"Измеренное значение перепада давления газа (dP2)",1,0x1,"МПа"},
	{ARCH_TAVG,20,0x230,"Измеренное значение температуры газа (T1)",1,0x1,"С"},
//        {ARCH_TAVG,40,0x24c,"Измеренное значение температуры газа (T2)",1,0x1,"С"},
	{ARCH_VWORK,16,0x234,"Объемный расход газа рабочие условия (Qр1)",1,0x1,"м3/ч"},
//	{ARCH_VWORK,36,0x250,"Объемный расход газа рабочие условия (Qр2)",1,0x1,"м3/ч"},
	{ARCH_VNORM,12,0x238,"Объемный расход газа (Q1)",1,0x1,"м3/ч"},
//	{ARCH_VNORM,32,0x254,"Объемный расход газа (Q2)",1,0x1,"м3/ч"},

	{ARCH_VAGG_WORK,23,0x0,"Тотальный объем в рабочих условиях по трубе 1",1,0x2bc,"м3"},
//	{ARCH_VAGG_WORK,43,0x8,"Тотальный объем в рабочих условиях по трубе 2",1,0x2cc,"м3"},
	{ARCH_VAGG_NORM,21,0x2100,"Тотальный объем в стандартных условиях по трубе 1",1,0x2c0,"м3"},
//	{ARCH_VAGG_NORM,41,0x2109,"Тотальный объем в стандартных условиях по трубе 2",1,0x2d0,"м3"},

	{20,500,0xf3,"Локальное время  корректора (от начала эпохи) 00:00:00  1 января 1970 года",1,0,"с"}};


struct _Archive archive741 [] =
    {	{ARCH_PAVG,18,8,"Среднее значение давления газа (P1)",1,0x2,"МПа"},
//	{ARCH_PAVG,38,24,"Среднее значение давления газа (P2)",1,0x2,"МПа"},
	{ARCH_TAVG,20,12,"Среднее значение температуры газа (T1)",1,0x2,"С"},
//        {ARCH_TAVG,40,28,"Среднее значение температуры газа (T2)",1,0x2,"С"},
	{ARCH_VWORK,16,16,"Интегральный объем газа рабочие условия (Qр1)",1,0x2,"м3/ч"},
//	{ARCH_VWORK,36,32,"Интегральный объем газа рабочие условия (Qр2)",1,0x2,"м3/ч"},
	{ARCH_VNORM,12,20,"Интегральный объем газа (Q1)",1,0x2,"м3/ч"},
//	{ARCH_VNORM,32,36,"Интегральный объем газа (Q2)",1,0x2,"м3/ч"}
	};

struct _Archive const741 [] =
{ 	{1,101,4,"Константное значение атмосферного давления",1,0,"мм.рт.ст."},
	{2,102,50,"Константное значение абсолютного давления",1,0,"МПа"},
	{3,103,51,"Константное значение перепада давления",1,0,"кПа"},
	{5,105,52,"Константное значение температуры",1,0,"C"},
	{6,106,5,"Константа плотности газа",1,0,"кг/м3"},
	{8,108,8,"Константа влажности газа",1,0,"%"},
	{14,114,6,"Доля азота",1,5,"%"},
	{15,115,7,"Доля диоксида углерода",1,6,"%"},

	{21,502,9,"Время пуска счета ( запуск учета ресурсов)",1,0,"с"},
	{22,506,15,"Расчетный час ( смешение в секундах от начала суток)",1,0,"с"},
	{23,507,14,"Расчетные сутки ( смещение в секундах от начала месяца",1,0,"с"},
	{24,509,11,"Коррекция времени вычислителя корректора в сутки (секунд)",1,0,"с"}};
//-----------------------------------------------------------------------------
struct _NScode {
    uint8_t	id;		// номер порядковый
    char	shrt[20];	// текстовое название параметра - короткое
    char	name[200];	// текстовое название параметра
};
struct _NScode nscode741 [] =
{	{0, "НС00", "Разряд батареи (напряжение батареи меньше порога 3,2 В"},
	{1, "НС01", "ЗАРЕЗЕРВИРОВАНО"},
	{2, "НС02", "Перегрузка по цепям питания датчиков давления (только для модели 02)"},
	{3, "НС03", "Активный уровень сигнала на дискретном входе D2"},
	{4, "НС04", "Сигнал Qр по каналу т1 меньше нижнего предела"},
	{5, "НС05", "Сигнал Qр по каналу т2 меньше нижнего предела"},
	{6, "НС06", "Сигнал Qр по каналу т1 превысил верхний предел"},
	{7, "НС07", "Сигнал Qр по каналу т2 превысил верхний предел"},
	{8, "НС08", "ЗАРЕЗЕРВИРОВАНО"},
	{9, "НС09", "Сигнал на входе ПД1 вне диапазона"},
	{10, "НС10", "Сигнал на входе ПД2 вне диапазона"},
	{11, "НС11", "Сигнал на входе ПД3 вне диапазона"},
	{12, "НС12", "Сигнал на входе ПД4 вне диапазона"},
	{13, "НС13", "Сигнал на входе ПД5 вне диапазона"},
	{14, "НС14", "Температура t1 вне диапазона -52...+92 °C"},
	{15, "НС15", "Температура t2 вне диапазона -52...+92 °C"},
	{16, "НС16", "Параметр P1 вышел за пределы уставок Ув, Ун."},
	{17, "НС17", "Параметр ΔP1 вышел за пределы уставок Ув, Ун."},
	{18, "НС18", "Параметр Qр1 вышел за пределы уставок Ув, Ун."},
	{19, "НС19", "Параметр P2 вышел за пределы уставок Ув, Ун."},
	{20, "НС20", "Параметр ΔP2 вышел за пределы уставок Ув, Ун."},
	{21, "НС21", "Параметр Qр2 вышел за пределы уставок Ув, Ун."},
	{22, "НС22", "Параметр ΔP3 вышел за пределы уставок Ув, Ун."},
	{23, "НС23", "Параметр P3 вышел за пределы уставок Ув, Ун."},
	{24, "НС24", "Параметр P4 вышел за пределы уставок Ув, Ун."},
	{25, "НС25", "Текущее суточное значение V по каналу ОБЩ превышает норму поставки"},
	{26, "НС26", "Отрицательное значение Кп по каналу 1"},
	{27, "НС27", "Отрицательное значение Кп по каналу 2"}};